
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/shimota-dev/aws-ecs-terraform/actions/runs/4776778771)



<pre><code>Apply complete! Resources: 7 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-008e5722bf30b8142]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-068e23561f8f078c6]
data.aws_iam_policy_document.ecs_task_assume: Reading...
aws_ecr_repository.ecr_repository: Refreshing state... [id=go-simple-server]
data.aws_iam_policy_document.ecs_assume: Reading...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0b187818db468838e]
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=320642683]
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=320642683]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=go-simple-server]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-043da24431e45029f]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-098322cf3202fb0ac]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:690440254734:targetgroup/go-simple-server-target-group/9fdb956edca04d04]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-07de421700351d7bf]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0ca4f15a04c6d08c9]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0c2c430090da69c66]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0feb4c9a6e80d8e33]
aws_security_group.alb: Refreshing state... [id=sg-018d694f340c980d4]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0057ecae1b13d1a40]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-098d91b31f5e3673c]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-033643a06f76e4b0c]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0846e4a017b57f8f5]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b50b2476369bbd39]
aws_security_group.ecs: Refreshing state... [id=sg-0be0c682e474673e2]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c96c0c5544b9b515]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:690440254734:loadbalancer/app/go-simple-server-alb/6d2089c9be21f289]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0645b77e410c9fc4c]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-012e09e94b920d8cd]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-065f54d280fda9f9d]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-07de421700351d7bf1080289494]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-2223750602]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-024def2a266365ea4]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05c2ce13ee4a00ce3]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-098d91b31f5e3673c1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-033643a06f76e4b0c1080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:690440254734:listener/app/go-simple-server-alb/6d2089c9be21f289/2d9f7b59157388ed]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:690440254734:listener-rule/app/go-simple-server-alb/6d2089c9be21f289/2d9f7b59157388ed/14f32ccd720edba0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/go-simple-server"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "go-simple-server"
      + tags_all           = (known after apply)
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "go-simple-server"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "go-simple-server"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:690440254734:targetgroup/go-simple-server-target-group/9fdb956edca04d04"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0be0c682e474673e2",
            ]
          + subnets          = [
              + "subnet-0846e4a017b57f8f5",
              + "subnet-0b50b2476369bbd39",
            ]
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "HEALTH_CHECK_PATH"
                          + value = "/health_checks"
                        },
                      + {
                          + name  = "NGINX_PORT"
                          + value = "8080"
                        },
                    ]
                  + image            = "medpeer/health_check:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/go-simple-server"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "go-simple-server"
                        }
                    }
                  + name             = "go-simple-server"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "go-simple-server"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_basic will be created
  + resource "aws_iam_role_policy_attachment" "ecs_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "go-simple-server-ecs"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
aws_iam_role.ecs: Creating...
aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
aws_ecs_cluster.ecs_cluster: Creating...
aws_iam_role.ecs_task: Creating...
aws_iam_role.ecs_task: Creation complete after 0s [id=go-simple-server-ecs-task]
aws_iam_role.ecs: Creation complete after 0s [id=go-simple-server-ecs]
aws_iam_role_policy_attachment.ecs_basic: Creating...
aws_iam_role_policy_attachment.ecs_basic: Creation complete after 0s [id=go-simple-server-ecs-20230423060849283900000001]
aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 1s [id=/aws/ecs/go-simple-server]
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_ecs_task_definition.ecs_task_definition: Creation complete after 1s [id=go-simple-server]
aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
aws_ecs_cluster.ecs_cluster: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:690440254734:cluster/go-simple-server]
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 1s [id=arn:aws:ecs:ap-northeast-1:690440254734:service/go-simple-server/go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":6,"Program":"tfcmt","SHA1":"dfb27d4634c5c790f46029112cfa663efdb8b6c9","Vars":{},"WorkflowName":"Terraform"} -->